# 예제 1-26 데이터프레임끼리 더하기

In [1]:
import pandas as pd
import seaborn as sns

### titanic  데이터셋에서 age, fare 2개 열을 선택하여 <br> 데이터프레임 만들기

In [2]:
titanic = sns.load_dataset('titanic')

In [4]:
df = titanic.loc[:, ['age', 'fare']]
df.tail() #마지막 5행 표시

      age   fare
886  27.0  13.00
887  19.0  30.00
888   NaN  23.45
889  26.0  30.00
890  32.0   7.75

### 데이터프레임에 숫자 10 더하기

In [5]:
addition = df + 10
addition.tail()

      age   fare
886  37.0  23.00
887  29.0  40.00
888   NaN  33.45
889  36.0  40.00
890  42.0  17.75

### 데이터프레임끼리 연산하기

In [6]:
subtraction = addition - df
subtraction.tail()

      age  fare
886  10.0  10.0
887  10.0  10.0
888   NaN  10.0
889  10.0  10.0
890  10.0  10.0

###

###

###

###

###

###

###

###

###

###

###

###

###

###

###